In [1]:
import pandas as pd
import numpy as np

In [2]:
import matplotlib as plt
from sklearn import linear_model

In [3]:
df = pd.read_csv("data.csv")

In [4]:
df

   Unnamed: 0  area  price
0           1  2000     55
1           2  3000     56
2           3  3200     61
3           4  3500     68
4           5  4000     72

In [8]:
df = df.drop(columns=['Unnamed: 0'])

In [9]:
df

   area  price
0  2000     55
1  3000     56
2  3200     61
3  3500     68
4  4000     72

In [ ]:
%matplotlib inline
plt.xlabel()